app/controllers/categories_controller.rb

  def index
    @categories = Category.find_all_by_user_id(session[:userid])
---
SELECT "categories".* FROM "categories" WHERE "categories"."user_id" = 0

  def create
    @category = Category.new(params[:category])
    @category.user_id = session[:userid];
    respond_to do |format|
      if @category.save
---
INSERT INTO "categories" ("created_at", "type_name", "updated_at", "user_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", Sat, 07 Jan 2012 13:40:51 UTC +00:00], ["type_name", "ssss"], ["updated_at", Sat, 07 Jan 2012 13:40:51 UTC +00:00], ["user_id", 0]]

  def update
    @category = Category.find(params[:id])
---
SELECT "categories".* FROM "categories" WHERE "categories"."id" = $1 LIMIT 1  [["id", "4"]]

  def destroy
    @category = Category.find(params[:id])
    @category.destroy
---
SELECT "categories".* FROM "categories" WHERE "categories"."id" = $1 LIMIT 1  [["id", "1"]]
DELETE FROM "categories" WHERE "categories"."id" = $1  [["id", 1]]