app/controllers/logins_controller.rb

SELECT "users".* FROM "users" WHERE "users"."userid" = 'faithnh' LIMIT 1
---
  def create
    @login = Login.new(params[:login])
    user = User.find_by_userid(params[:userid])