app/controllers/users_controller.rb

  def create
    @user = User.new(params[:user])

    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("created_at", "password", "updated_at", "userid") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", Sat, 07 Jan 2012 08:54:58 UTC +00:00], ["password", "ssss"], ["updated_at", Sat, 07 Jan 2012 08:54:58 UTC +00:00], ["userid", "faithnh"]]