app/controllers/words_controller.rb

SELECT words.id, type_name, problem, answer FROM "words" LEFT OUTER JOIN categories ON words.category_id = categories.id WHERE "words"."user_id" = 0 AND "words"."category_id" = 12
SELECT "categories".* FROM "categories" WHERE "categories"."user_id" = 0
SELECT type_name, problem, answer FROM "words" WHERE "words"."user_id" = 0
---
  def index


    if params[:target_category] != nil
      @words = Word.joins("LEFT OUTER JOIN categories ON words.category_id = categories.id")
      .where(:user_id => session[:userid]).where(:category_id => params[:target_category])
      .select("words.id, type_name, problem, answer")
    else
      @words = Word.joins("LEFT OUTER JOIN categories ON words.category_id = categories.id")
      .where(:user_id => session[:userid])
      .select("words.id, type_name, problem, answer")
    end

    @category = Category.find_all_by_user_id(session[:userid])

SELECT "words".* FROM "words" WHERE "words"."id" = $1 LIMIT 1  [["id", "1"]]
---
  def show
    @word = Word.find(params[:id])

SELECT "categories".* FROM "categories" WHERE "categories"."user_id" = 0
---
  def new
    @word = Word.new
    @category = Category.find_all_by_user_id(session[:userid])

SELECT "words".* FROM "words" WHERE "words"."id" = $1 LIMIT 1  [["id", "2"]]
SELECT "categories".* FROM "categories" WHERE "categories"."user_id" = 0
---
  def edit
    @word = Word.find(params[:id])
    @category = Category.find_all_by_user_id(session[:userid])

INSERT INTO "words" ("answer", "category_id", "created_at", "problem", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["answer", "問題"], ["category_id", nil], ["created_at", Sat, 07 Jan 2012 12:14:49 UTC +00:00], ["problem", "problem"], ["updated_at", Sat, 07 Jan 2012 12:14:49 UTC +00:00], ["user_id", nil]]
---
  def create
    @word = Word.new(params[:word])
    @word.user_id = session[:userid];
    respond_to do |format|
      if @word.save

SELECT "words".* FROM "words" WHERE "words"."id" = $1 LIMIT 1  [["id", "2"]]
UPDATE "words" SET "category_id" = 8, "updated_at" = '2012-01-07 13:22:58.890747' WHERE "words"."id" = 2
---
  def update
    @word = Word.find(params[:id])

    respond_to do |format|
      if @word.update_attributes(params[:word])

SELECT "words".* FROM "words" WHERE "words"."id" = $1 LIMIT 1  [["id", "2"]]
DELETE FROM "words" WHERE "words"."id" = $1  [["id", 2]]
---
  def destroy
    @word = Word.find(params[:id])
    @word.destroy